[
    
    {
        "title": "Responsive Card Design",
        "imageSrc": "projects/card.png",
        "description": "This is a project designed to change image quality based on the size of the user's device. The first card uses resolution switching, while the second card uses art-direction.",
        "skills": ["HTML", "CSS", "JS"],
        "demo": "https://people.rit.edu/smc9253/252/card/mobile.html",
        "source": "https://www.github.com"
    },

    {
        "title": "Top 10 Places to Eat",
        "imageSrc": "projects/10Places.png",
        "description": "This is a project designed to show the user the top 10 highly rated places to eat in Rochester. This website uses localStorage and cookies to save the user's previous likes.",
        "skills": ["HTML", "CSS", "JS"],
        "demo": "https://people.rit.edu/smc9253/252/webapp/start.html",
        "source": "https://github.com/Skyshydiva/top-10-eat"
    },

    {
        "title": "Baltimore County - Hometown",
        "imageSrc": "projects/bc.png",
        "description": "This project involves creating a 10-page website about a place I’ve lived or visited, showcasing original content, images, and graphics. The site includes six content pages about the location, with at least one featuring a slideshow, plus a contact or about page, a form page with functional checkboxes and radio buttons, a page explaining how the project meets grading criteria, and a references page. Built using HTML5 and CSS3, the site emphasizes strong content organization, clear navigation, and a professional design to enhance the user experience.",
        "skills": ["HTML", "CSS", "JS"],
        "demo": "https://people.rit.edu/smc9253/iste240/IndividualProjectpt1.html"
    },

    {
        "title": "iSchool Website",
        "imageSrc": "projects/iSchool.png",
        "description": "This project creates a professional web presence for the iSchool by consuming data from an API to display information about programs, employment, and people. It features dynamic data fetching, interactive UI components, and an innovative, user-friendly design to enhance the experience.",
        "skills": ["HTML", "CSS", "React"],
        "demo": "https://people.rit.edu/smc9253/340/viteReact/"
    }

]